/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Расширение Telesec";
"06 06 02 82 06 01 0A 01"		= "Механизм Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Аутентификация Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Аутентификация по паролю";
"06 08 02 82 06 01 0A 01 00 02" = "Аутентификация по защищенному паролю";
"06 08 02 82 06 01 0A 01 00 03" = "Односторонняя аутентификация X.509";
"06 08 02 82 06 01 0A 01 00 04" = "Двусторонняя аутентификация X.509";
"06 08 02 82 06 01 0A 01 00 05" = "Трехсторонняя аутентификация X.509";
"06 08 02 82 06 01 0A 01 00 06" = "Односторонняя аутентификация ISO9798";
"06 08 02 82 06 01 0A 01 00 07" = "Двусторонняя аутентификация ISO9798";
"06 08 02 82 06 01 0A 01 00 08" = "Аутентификация Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Подпись Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 с RSA и ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 с RSA и стандарт подписи Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 с RSA и ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 с RSA и стандарт подписи Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 с RSA и стандарт подписи Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Подпись HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "Шифрование Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "нет";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Пурпурный";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Функция одностороннего действия";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Хеширование с использованием блочного шифра";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Функция FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Модуль Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Алгоритмы";
"06 07 02 82 06 01 0A 02 01"	= "Типы атрибута";
"06 07 02 82 06 01 0A 02 02"	= "Типы сертификатов";
"06 07 02 82 06 01 0A 02 03"	= "Типы сообщений";
"06 07 02 82 06 01 0A 02 04"	= "Протокол PL";
"06 07 02 82 06 01 0A 02 05"	= "SME и компоненты SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Полезные определения";
"06 07 02 82 06 01 0A 02 08"	= "Файлы STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Электронный заказ";
"06 07 02 82 06 01 0A 02 0B"	= "Асимметричная программа Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Базовая программа Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Сообщения Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Приложение временных меток Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "Класс объекта";
"06 07 02 82 06 01 0A 03 00"	= "Другое имя Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Каталог";
"06 07 02 82 06 01 0A 03 02"	= "Тип каталога";
"06 07 02 82 06 01 0A 03 03"	= "Группа каталогов";
"06 07 02 82 06 01 0A 03 04"	= "Пользователь каталога";
"06 07 02 82 06 01 0A 03 05"	= "Ввод ключа шифрования-дешифрования";

"06 06 02 82 06 01 0A 04"		= "Пакет";
"06 06 02 82 06 01 0A 05"		= "Параметр";
"06 06 02 82 06 01 0A 06"		= "Связывание имен";
"06 06 02 82 06 01 0A 07"		= "Атрибут";
"06 07 02 82 06 01 0A 07 00"	= "Идентификатор группы программы";
"06 07 02 82 06 01 0A 07 01"	= "Тип сертификата";
"06 07 02 82 06 01 0A 07 02"	= "Сертификат Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Номер сертификата";
"06 07 02 82 06 01 0A 07 04"	= "Список аннулирования сертификатов";
"06 07 02 82 06 01 0A 07 05"	= "Дата создания";
"06 07 02 82 06 01 0A 07 06"	= "Эмитент";
"06 07 02 82 06 01 0A 07 07"	= "Именующий орган";
"06 07 02 82 06 01 0A 07 08"	= "Папка открытого каталога";
"06 07 02 82 06 01 0A 07 09"	= "Домен безопасности";
"06 07 02 82 06 01 0A 07 0A"	= "Тема";
"06 07 02 82 06 01 0A 07 0B"	= "Время аннулирования";
"06 07 02 82 06 01 0A 07 0C"	= "Номер группы пользователя";
"06 07 02 82 06 01 0A 07 0D"	= "Срок действия";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Среда сообщений системы безопасности";
"06 07 02 82 06 01 0A 07 10"	= "Анонимный каталог открытого ключа";
"06 07 02 82 06 01 0A 07 11"	= "Имя Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Добавления имени";
"06 07 02 82 06 01 0A 07 13"	= "Почтовый индекс Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Отличительный признак имени";
"06 07 02 82 06 01 0A 07 15"	= "Список сертификатов Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Список сертификатов Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Список сертификатов X.509";
"06 07 02 82 06 01 0A 07 18"	= "Время выпуска";
"06 07 02 82 06 01 0A 07 19"	= "Номер физической карты";
"06 07 02 82 06 01 0A 07 1A"	= "Тип файла";
"06 07 02 82 06 01 0A 07 1B"	= "Файл Ctl – архив";
"06 07 02 82 06 01 0A 07 1C"	= "Адрес электронной почты";
"06 07 02 82 06 01 0A 07 1D"	= "Список шаблонов сертификата";
"06 07 02 82 06 01 0A 07 1E"	= "Имя каталога";
"06 07 02 82 06 01 0A 07 1F"	= "Имя типа каталога";
"06 07 02 82 06 01 0A 07 20"	= "Имя группы каталогов";
"06 07 02 82 06 01 0A 07 21"	= "Имя пользователя каталога";
"06 07 02 82 06 01 0A 07 22"	= "Флажок аннулирования";
"06 07 02 82 06 01 0A 07 23"	= "Имя записи ключа зашифровывания-расшифровывания";
"06 07 02 82 06 01 0A 07 24"	= "Номер GL";
"06 07 02 82 06 01 0A 07 25"	= "Номер GO";
"06 07 02 82 06 01 0A 07 26"	= "Данные ключа G";
"06 07 02 82 06 01 0A 07 27"	= "Данные ключа Z";
"06 07 02 82 06 01 0A 07 28"	= "Данные ключа KT";
"06 07 02 82 06 01 0A 07 2A"	= "Номер ключа KT";
"06 07 02 82 06 01 0A 07 33"	= "Время генерирования аннулирования сертификата";
"06 07 02 82 06 01 0A 07 34"	= "Текст об ответственности";

"06 06 02 82 06 01 0A 08"		= "Группа атрибута";
"06 06 02 82 06 01 0A 09"		= "Действие";
"06 06 02 82 06 01 0A 0A"		= "Уведомление";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Приложение безопасности";

"06 06 02 82 06 01 0A 0C"		= "Определения расширения сертификата и аннулирования сертификата";

"06 07 02 82 06 01 0A 0C 00"	= "Расширение ограничения ответственности расширения сертификата";
"06 07 02 82 06 01 0A 0C 01"	= "Расширение идентификатора сертификата Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Идентификатор политики Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "Идентификатор квалификатора политики Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Фильтрованное расширение аннулирования сертификата Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Расширение фильтра аннулирования сертификата Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Расширение именующего органа Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID пользователя";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Почтовый ящик RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Компонент домена";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Австралийский бизнес-номер";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Идентификатор австралийской политики в отношении сертификатов";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Идентификатор политики Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Симметричный алгоритм шифрования";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Идентификатор политики SEIS High-Assurance";
"06 06 2A 85 70 22 01 02"	= "Идентификатор политики SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Личный идентификатор SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Модуль ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Управление сертификатами X9F1";
"06 06 2A 86 48 CE 38 02"		= "Инструкция удержания";
"06 07 2A 86 48 CE 38 02 01"	= "Инструкция удержания - нет";
"06 07 2A 86 48 CE 38 02 02"	= "Эмитент вызова";
"06 07 2A 86 48 CE 38 02 03"	= "Отклонить";
"06 07 2A 86 48 CE 38 02 04"	= "Маркерное кольцо съема сигнала";
"06 06 2A 86 48 CE 38 03"		= "Атрибут";
"06 06 2A 86 48 CE 38 03 01"	= "Подпись, удостоверяющая другую подпись";
"06 06 2A 86 48 CE 38 03 02"	= "Сертификат атрибута";
"06 06 2A 86 48 CE 38 04"		= "Алгоритм";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Соответствие DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA с SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Тип поля ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Простое поле";
"06 07 2A 86 48 CE 3D 01 02"	= "Поле характеристики-два";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Базис характеристика-два";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Нулевой базис";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Трехчленный базис";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Пятичленный базис";
"06 06 2A 86 48 CE 3D 02"		= "Тип открытого ключа";
"06 07 2A 86 48 CE 3D 02 01"	= "Открытый ключ эллиптической кривой";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Тип поля ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Поле Галуа простое";
"06 06 2A 86 48 CE 3E 02"		= "Тип номера";
"06 07 2A 86 48 CE 3E 02 01"	= "Открытый ключ Диффи-Хеллмана";
"06 06 2A 86 48 CE 3E 03"		= "Схема";
"06 07 2A 86 48 CE 3E 03 01"	= "Статика Диффи-Хеллмана";
"06 07 2A 86 48 CE 3E 03 02"	= "Алгоритм Диффи-Хеллмана краткосрочный";
"06 07 2A 86 48 CE 3E 03 03"	= "Гибрид 1 Диффи-Хеллмана";
"06 07 2A 86 48 CE 3E 03 04"	= "Гибрид 2 Диффи-Хеллмана";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Информация о версии Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE с MD5 и CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC на основе пароля";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Доверить пользователю";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Доверить информацию органа сертификации";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Сертификат атрибута";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Шифрование RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 с шифрованием RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 с шифрованием RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 с шифрованием RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 с шифрованием RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Шифрование RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Шифрование RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Указана метка RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Схема подписи RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 с шифрованием RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 с шифрованием RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 с шифрованием RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 с шифрованием RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Шифрование BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Согласование ключей Диффи-Хеллмана";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE с MD2 и DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE с MD5 и DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE с MD2 и RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE с MD5 и RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE с MD5 и XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE с SHA и DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Данные";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Подписанные данные";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Упакованные данные";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Подписанные и упакованные данные";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Обработанные данные";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Зашифрованные данные";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Данные с атрибутами";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Информация зашифрованного личного ключа";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Адрес электронной почты";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Неструктурированное имя";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Тип содержания";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Профиль сообщения";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Время подписи";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Подпись, удостоверяющая другую подпись";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Запрос пароля";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Неструктурированный адрес";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Расширенные атрибуты сертификата";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Эмитент и серийный номер";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Проверка пароля";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Открытый ключ";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Описание подписи";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Запрос расширения";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Возможности S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Предпочесть подписанные данные";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Не поддаются расшифровке";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Запрос приема";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Прием";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Советы по содержанию";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "История расширения почтового списка";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Модули S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Синтаксис криптографического сообщения";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Дополнительные службы безопасности";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Идентификатор объекта S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Сообщение S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Электронная подпись 88 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Электронная подпись 97 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Политика электронной подписи 88 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Политика электроной подписи 97 ETS";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Типы содержания S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Аутентифицированные атрибуты S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Алгоритмы S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Распределение сертификатов S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Распределение сертификатов LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Квалификатор политики подписи S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Идентификатор типа подписи S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Подпись создателя";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Подпись домена";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Подпись дополнительных атрибутов";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Подпись анализа";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Возможности S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Предпочитать бинарный внутри";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Удобное имя (для PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Идентификатор локального ключа (для PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Типы сертификата (для PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Сертификат X.509 (для PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Сертификат SDSI (для PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Типы CRL (для PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (для PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 Синтаксис обмена личной информацией";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "Идентификаторы шифрования на основе пароля PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE с SHA-1 и 128-бит RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE с SHA-1 и 40-бит RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE с SHA-1 и 3-ключевым Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE с SHA-1 и 2-ключевым Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE с SHA-1 и 128-бит RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE with SHA-1 and 40-Bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "Идентификаторы PKCS-12 ESPVK";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Защита ключа PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "Идентификаторы PKCS-12 Bag";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "Идентификатор PKCS-12 Key Bag";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Идентификатор сертификата PKCS-12 и CRL Bag";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "Идентификатор PKCS-12 Secret Bag";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "Идентификатор безопасного содержания PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "Идентификатор PKCS-12 PKCS-8 Shrouded Key Bag";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "Идентификатор PKCS-12 Certificate Bag";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "Идентификатор сертификата PKCS-12 X.509 и CRL Bag";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "Идентификатор PKCS-12 SDSI Certificate Bag";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "Идентификатор шифрования на основе пароля PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE с SHA-1 и 128-бит RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE с SHA-1 и 40-бит RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE с SHA-1 и Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE с SHA-1 и 128-бит RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE с SHA-1 и 40-бит RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE с SHA-1 и RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE с SHA-1 и RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "Внешние идентификаторы PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Шифрование PKCS-12 RSA с 128-бит RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Шифрование PKCS-12 RSA с 40-бит RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Шифрование PKCS-12 RSA с Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "Идентификатор подписи PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Подпись PKCS-12 RSA с SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 версия 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "Идентификаторы PKCS-12 Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Мультимножество ключей PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Мультимножество защищенных ключей PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Мультимножество сертификатов PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Мультимножество PKCS-12 CRL";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Мультимножество PKCS-12 Secret";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Мультимножество безопасного содержания PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Модули PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Атрибуты PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Тип содержания PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Содержание PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Алгоритм комбинированного сообщения RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC с SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Алгоритм шифрования RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 с MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "«Пустышка» RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Неизвестный идентификатор политики Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT межпользовательский Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Класс объектов Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Адресация сайта";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Схема класса";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Схема атрибута";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Mailbox-Agent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Ящик";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Контейнер";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Получатель почты";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Механизм доставки";

"06 07 2A 86 48 86 F7 14 04"				= "Форматы файлов Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Код аутентификации";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Непрямой контекст данных SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Информация агентства SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Тип оператора SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Информация SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Расширения сертификатов SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Данные изображения SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC Link (тип 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Индивидуальная кодовая подпись";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Коммерческая кодовая подпись";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC Link (тип 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Минимальные критерии SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Финансовые критерии SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC Link (тип 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Поставщик услуг обеспечения безопасности NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Подпись, удостоверяющая другую подпись с временной меткой";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Список доверительных сертификатов";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Расширение сортированного CTL";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Размещение следующего обновления";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Улучшенное использование ключей";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Подпись списка доверительности сертификатов";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Подпись временной метки";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Вентильный шифратор сервера";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Серийное шифрование";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Системы шифрованных файлов";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Восстановление систем шифрованных файлов";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Аппаратная совместимость Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Подпись NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Подпись производителя аппаратного обеспечения Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Вставленная подпись NT";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Подпись списка доверительных корней";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Квалифицированная субординация";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Восстановление ключа";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Подпись документа";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Идентификаторы объекта атрибута";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Атрибут доверительности Да/Нет";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Индивидуализация Microsoft DRM";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Лицензии Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Сервер лицензий Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Идентификаторы  объектов Microsoft PKCS-10";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Сертификат обновления";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Пара имя/значение записи";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Запись CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Версия ОС";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Атрибуты Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Набор ключей локального компьютера";

"06 08 2B 06 01 04 01 82 37 14"				= "Инфраструктура Microsoft Enrollment";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Использование Auto-Enroll CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Тип сертификата записи";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Агент записи";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Вход Смарт-карта";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Глава NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Инфраструктура сервера сертификатов Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Версия обновления органа сертификации Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Версия CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Атрибут CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Имя документа";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Описание документа";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Зашифрованные данные";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Зашифрованное содержание";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Идентификатор политики UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Идентификатор политики ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Идентификатор политики органа сертификации ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal с SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal с RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Атрибуты cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Проверка наличия cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP Ответ RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP Ответ RTCS расширенный";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Причина расширенного CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Основные характеристики";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Загрузка PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Содержание cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Данные конфигурации cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Индекс пользователя cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Информация пользователя cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Идентификатор политики XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Система подписи времени";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Система 80 подписи времени";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Система 380 подписи времени";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Система 400 подписи времени";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Дополнительные приемы";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Физические идентификаторы";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Данные аутентификации Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Данные ключей Диффи-Хеллмана Kerberos";
"06 07 2B 06 01 05 02 03 03"        = "Данные ключей ответа Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Аутентификация клиента Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Центр распространения ключей  Kerberos (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Простой механизм открытого ключа (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Инфраструктура открытого ключа";

"06 07 2B 06 01 05 05 07 01"		= "Расширения личного сертификата PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Доступ к информации бюро сертификации";
"06 08 2B 06 01 05 05 07 01 02"		= "Биометрическая информация";
"06 08 2B 06 01 05 05 07 01 03"		= "Квалифицированные операторы сертификата";
"06 08 2B 06 01 05 05 07 01 04"		= "Удостоверение аудита сертификата атрибута";
"06 08 2B 06 01 05 05 07 01 05"		= "Выбор сертификата атрибута";
"06 08 2B 06 01 05 05 07 01 06"		= "Элементы управления бюро сертификации атрибута";
"06 08 2B 06 01 05 05 07 01 07"		= "Блок IP-адреса SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Идентификатор автономной системы SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Идентификатор маршрутизатора SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Операции прокси сертификата атрибута";
"06 08 2B 06 01 05 05 07 01 0B"		= "Доступ к информации субъекта";
"06 08 2B 06 01 05 05 07 01 0C"		= "Логотип";

"06 07 2B 06 01 05 05 07 02"		= "Типы квалификатора политики";
"06 08 2B 06 01 05 05 07 02 01"		= "Заявление о практике использования сертификатов";
"06 08 2B 06 01 05 05 07 02 02"		= "Замечание пользователя";
"06 08 2B 06 01 05 05 07 02 03"		= "Текстовое примечание";

"06 07 2B 06 01 05 05 07 03"		= "Цель ключа";
"06 08 2B 06 01 05 05 07 03 01"		= "Аутентификация сервера";
"06 08 2B 06 01 05 05 07 03 02"		= "Аутентификация клиента";
"06 08 2B 06 01 05 05 07 03 03"		= "Кодовая подпись";
"06 08 2B 06 01 05 05 07 03 04"		= "Защита электронной почты";
"06 08 2B 06 01 05 05 07 03 05"		= "Конечная система IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Туннель IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Пользователь IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Присвоение временных меток";
"06 08 2B 06 01 05 05 07 03 09"		= "Подпись OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Аутентификация сервера SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Типы информации CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Сертификат шифрования протокола органа сертификации";
"06 08 2B 06 01 05 05 07 04 02"		= "Типы пар подписывающих ключей";
"06 08 2B 06 01 05 05 07 04 03"		= "Типы пар ключей шифрования";
"06 08 2B 06 01 05 05 07 04 04"		= "Предпочтительный симметричный алгоритм";
"06 08 2B 06 01 05 05 07 04 05"		= "Информация об обновлении ключа органа сертификации";
"06 08 2B 06 01 05 05 07 04 06"		= "Аннулирование текущего сертификата";
"06 08 2B 06 01 05 05 07 04 07"		= "Неподдерживаемые OID";
"06 08 2B 06 01 05 05 07 04 08"		= "Запрос на подписку";
"06 08 2B 06 01 05 05 07 04 09"		= "Ответ на запрос подписки";
"06 08 2B 06 01 05 05 07 04 0A"		= "Запрос параметра пары ключей";
"06 08 2B 06 01 05 05 07 04 0B"		= "Ответ параметра пары ключей";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Регистрация CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Управление регистрацией";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Регистрационный токен";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Идентификатор";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Информация публикации PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Параметры архива PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Старый идентификатор сертификата";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Ключ шифрования протокола";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Изменить шаблон сертификата";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Шаблон WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Информация о регистрации CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Пары UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Запрос сертификата";

"06 07 2B 06 01 05 05 07 06"		= "Алгоритмы";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Без подписи";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Элементы управления CMC";

"06 07 2B 06 01 05 05 07 08"		= "Другие имена";
"06 08 2B 06 01 05 05 07 08 01"		= "Личные данные";
"06 08 2B 06 01 05 05 07 08 02"		= "Группа пользователей";

"06 07 2B 06 01 05 05 07 09"		= "Личные данные";
"06 08 2B 06 01 05 05 07 09 01"		= "Дата рождения";
"06 08 2B 06 01 05 05 07 09 02"		= "Место рождения";
"06 08 2B 06 01 05 05 07 09 03"		= "Псевдоним";
"06 08 2B 06 01 05 05 07 09 04"		= "Пол";
"06 08 2B 06 01 05 05 07 09 05"		= "Страна гражданства";
"06 08 2B 06 01 05 05 07 09 06"		= "Страна проживания";

"06 07 2B 06 01 05 05 07 0A"		= "Сертификат атрибута";
"06 08 2B 06 01 05 05 07 0A 01"		= "Информация аутентификации";
"06 08 2B 06 01 05 05 07 0A 02"		= "Удостоверение доступа";
"06 08 2B 06 01 05 05 07 0A 03"		= "Удостоверение тарификации";
"06 08 2B 06 01 05 05 07 0A 04"		= "Группа";
"06 08 2B 06 01 05 05 07 0A 05"		= "Роль";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Протокол статуса онлайнового сертификата";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Основной ответ OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Данное расширение OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Номер OCSP CRL";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Ответ OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Без проверки аннулирования OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Срез архива OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Указатель службы OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Эмитенты органа сертификации";
"06 08 2B 06 01 05 05 07 30 03"		= "Присвоение временных меток";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE промежуточный";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Алгоритм шифрования DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Хеш-алгоритм DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Алгоритм подписи DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 с RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 с RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 с RSA";
"06 05 2B 0E 03 02 03"				= "MD5 с RSA";
"06 05 2B 0E 03 02 04"				= "MD4 с шифрованием RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N с RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Подпись RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA с SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 с подписью RSA";
"06 05 2B 0E 03 02 0F"				= "SHA с подписью RSA";
"06 05 2B 0E 03 02 10"				= "Алгоритм Диффи-Хеллмана с общим модулем";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA общий";
"06 05 2B 0E 03 02 15"				= "DSA общий с SHA";
"06 05 2B 0E 03 02 16"				= "Транспорт ключа RSA";
"06 05 2B 0E 03 02 17"				= "Хеш-печать с ключом";
"06 05 2B 0E 03 02 18"				= "MD2 с подписью RSA";
"06 05 2B 0E 03 02 19"				= "MD5 с подписью RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA с SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA с общим SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 с шифрованием RSA";
"06 05 2B 0E 03 03 01"				= "Механизм простой строгой аутентификации";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 с RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 с ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Документ";
"06 04 2B 24 01 01"					= "Окончательная версия";
"06 04 2B 24 01 02"					= "Черновик";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Алгоритм";
"06 04 2B 24 03 01"					= "Алгоритм шифрования";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "«Пустышка» DES-ECB";
"06 07 2B 24 03 01 01 01 01"		= "«Пустышка» DES-ECB ISO";
"06 07 2B 24 03 01 01 02 01"		= "«Пустышка» DES-CBC";
"06 08 2B 24 03 01 01 02 01 01"		= "«Пустышка» DES-CBC ISO";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "«Пустышка» DES3-ECB";
"06 08 2B 24 03 01 03 01 01 01"		= "«Пустышка» DES3-ECB ISO";
"06 07 2B 24 03 01 03 02 01"		= "«Пустышка» DES3-CBC";
"06 08 2B 24 03 01 03 02 01 01"		= "«Пустышка» DES3-CBC ISO";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "«Пустышка» IDEA-ECB";
"06 08 2B 24 03 01 02 01 01 01"		= "«Пустышка» IDEA-ECB ISO";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "«Пустышка» IDEA-CBC";
"06 08 2B 24 03 01 02 02 01 01"		= "«Пустышка» IDEA-CBC ISO";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Шифрование RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "«Пустышка» BSI-1-ECB";
"06 06 2B 24 03 01 05 02"			= "«Пустышка» BSI-1-CBC";
"06 07 2B 24 03 01 05 02 01"		= "«Пустышка» BSI-1-CBC PEM";

"06 04 2B 24 03 02"					= "Хеш-алгоритм";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Одинарная длина MDC2";
"06 05 2B 24 03 02 05"				= "Двойная длина MDC2";
"06 04 2B 24 03 03"					= "Алгоритм подписи";
"06 05 2B 24 03 03 01"				= "Подпись RSA";

"06 06 2B 24 03 03 01 01"			= "Подпись RSA с SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Подпись RSA с SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Подпись RSA с SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Подпись RSA с SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Подпись RSA с SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Подпись RSA с SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Подпись RSA с SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Подпись RSA с SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Подпись RSA с SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Подпись RSA с SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Подпись RSA с SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Подпись RSA с SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Подпись RSA с SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Подпись RSA с SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Подпись RSA с SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Подпись RSA с SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Подпись RSA с SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Подпись RSA с SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Подпись RSA с SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Подпись RSA с SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Подпись RSA с SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Подпись RSA с SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Подпись RSA с SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Подпись RSA с SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Подпись RSA с SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Подпись RSA с SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Подпись RSA с RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Подпись RSA с RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Подпись RSA с RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Подпись RSA с RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Подпись RSA с RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Подпись RSA с RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Подпись RSA с RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Подпись RSA с RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Подпись RSA с RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Подпись RSA с RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Подпись RSA с RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Подпись RSA с RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Подпись RSA с RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Подпись RSA с RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Подпись RSA с RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Подпись RSA с RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Подпись RSA с RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Подпись RSA с RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Подпись RSA с RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Подпись RSA с RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Подпись RSA с RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Подпись RSA с RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Подпись RSA с RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Подпись RSA с RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Подпись RSA с RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Подпись RSA с RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Подпись RSA с RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Подпись RSA с RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Подпись ECSIE";
"06 06 2B 24 03 03 02 01"			= "Подпись ECSIE с SHA-1";
"06 06 2B 24 03 03 02 02"			= "Подпись ECSIE с RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Подпись ECSIE с MD2";
"06 06 2B 24 03 03 02 04"			= "Подпись ECSIE с MD5";

"06 04 2B 24 03 04"					= "Схема подписи";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 с RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 с RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 с RND";

"06 03 2B 24 04"					= "Атрибут";
"06 03 2B 24 05"					= "Политика";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Производитель - определенный API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Функциональность - определенный API";
"06 03 2B 24 07"					= "Управление ключами";
"06 04 2B 24 07 01"					= "Соглашение о ключах";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Передача ключа";
"06 05 2B 24 07 02 01"				= "ISO9796-2 с шифрованием RSA";

"06 05 2B 24 08 01 01"				= "Идентификатор политики Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Службы каталогов";

"06 05 2B 24 08 03 01"				= "Дата создания сертификата";
"06 05 2B 24 08 03 02"				= "Предоставление займа";
"06 05 2B 24 08 03 03"				= "Разрешение";
"06 05 2B 24 08 03 04"				= "Денежное ограничение";
"06 05 2B 24 08 03 05"				= "Решение большинством голосов";
"06 05 2B 24 08 03 06"				= "Серийный номер чип-карты";
"06 05 2B 24 08 03 07"				= "Номер открытого ключа";
"06 05 2B 24 08 03 08"				= "Ограничение";
"06 05 2B 24 08 03 09"				= "Выбрать, если разрешено";
"06 05 2B 24 08 03 0A"				= "Запрошенный сертификат";
"06 05 2B 24 08 03 0B"				= "Именующие органы";
"06 05 2B 24 08 03 0C"				= "Сертификат в каталоге с";
"06 05 2B 24 08 03 0D"				= "Хеш сертификата";

"06 05 2B 24 08 04 01"				= "Личные данные";
"06 05 2B 24 08 04 08"				= "Ограничение";
"06 07 2B 24 08 05 01 01 01"		= "RSA указывает SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA указывает RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA с SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA с RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA расширенный";
"06 07 2B 24 08 05 01 02 02"		= "DSA с RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Сертификат";
"06 05 2B 24 08 06 02"				= "Ссылка сертификата";
"06 05 2B 24 08 06 03"				= "Сертификат атрибута";
"06 05 2B 24 08 06 04"				= "Номер атрибута";
"06 05 2B 24 08 06 05"				= "Имя файла";
"06 05 2B 24 08 06 06"				= "Время хранения";
"06 05 2B 24 08 06 07"				= "Размер файла";
"06 05 2B 24 08 06 08"				= "Размещение";
"06 05 2B 24 08 06 09"				= "Номер подписи";
"06 05 2B 24 08 06 0A"				= "Автоматически генерированный";

"06 05 2B 24 08 07 01"				= "Типы презентации Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Двоичный";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Текст";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Расширение сертификата Thawte";
"06 05 2B 65 01 04 01"				= "Защищенная экстрасеть";

/* X.520 */

"06 02 55 04"		= "Типы атрибута X.520";
"06 03 55 04 00"	= "Класс объекта";
"06 03 55 04 01"	= "Имя записи с псевдонимом";
"06 03 55 04 02"	= "Информация о знаниях";
"06 03 55 04 03"	= "Общее имя";
"06 03 55 04 04"	= "Фамилия";
"06 03 55 04 05"	= "Серийный номер";
"06 03 55 04 06"	= "Название страны";
"06 03 55 04 07"	= "Населенный пункт";
"06 04 55 04 07 01"	= "Населенный пункт (собирательно)";
"06 03 55 04 08"	= "Область/край/республика";
"06 04 55 04 08 01"	= "Область/край/республика (собирательно)";
"06 03 55 04 09"	= "Адрес проживания";
"06 04 55 04 09 01"	= "Собирательный адрес проживания";
"06 03 55 04 0A"	= "Название организации";
"06 04 55 04 0A 01"	= "Собирательное название организации";
"06 03 55 04 0B"	= "Название подразделения";
"06 04 55 04 0B 01"	= "Собирательное название подразделения";
"06 03 55 04 0C"	= "Название";
"06 03 55 04 0D"	= "Описание";
"06 03 55 04 0E"	= "Справочник";
"06 03 55 04 0F"	= "Сфера деятельности";
"06 03 55 04 10"	= "Почтовый адрес";
"06 04 55 04 10 01"	= "Собирательный почтовый адрес";
"06 03 55 04 11"	= "Почтовый индекс";
"06 04 55 04 11 01"	= "Собирательный почтовый индекс";
"06 03 55 04 12"	= "А/я";
"06 04 55 04 12 01"	= "Собирательный а/я";
"06 03 55 04 13"	= "Номер комнаты";
"06 04 55 04 13 01"	= "Собирательное название офиса для доставки";
"06 03 55 04 14"	= "Номер телефона";
"06 04 55 04 14 01"	= "Собирательный номер телефона";
"06 03 55 04 15"	= "Номер телекса";
"06 04 55 04 15 01"	= "Собирательный номер телекса";
"06 03 55 04 16"	= "Идентификатор терминала телетекста";
"06 04 55 04 16 01"	= "Собирательный идентификатор терминала Teletex";
"06 03 55 04 17"	= "Номер факса";
"06 04 55 04 17 01"	= "Собирательный номер факса";
"06 03 55 04 18"	= "Адрес X.121";
"06 03 55 04 19"	= "Международный ISDN-номер";
"06 04 55 04 19 01"	= "Собирательный международный ISDN-номер";
"06 03 55 04 1A"	= "Зарегистрированный адрес";
"06 03 55 04 1B"	= "Индикатор места назначения";
"06 03 55 04 1C"	= "Предпочтительный способ доставки";
"06 03 55 04 1D"	= "Адрес презентации";
"06 03 55 04 1E"	= "Поддерживаемый контекст программы";
"06 03 55 04 1F"	= "Член";
"06 03 55 04 20"	= "Владелец";
"06 03 55 04 21"	= "Исполнитель функции";
"06 03 55 04 22"	= "См. также";
"06 03 55 04 23"	= "Пароль пользователя";
"06 03 55 04 24"	= "Сертификат пользователя";
"06 03 55 04 25"	= "Сертификат органа сертификации";
"06 03 55 04 26"	= "Список аннулирования полномочий";
"06 03 55 04 27"	= "Список аннулирования сертификатов";
"06 03 55 04 28"	= "Перекрестная пара сертификатов";
"06 03 55 04 29"	= "Имя";
"06 03 55 04 2A"	= "Имя";
"06 03 55 04 2B"	= "Инициалы";
"06 03 55 04 2C"	= "Квалификатор образования";
"06 03 55 04 2D"	= "Уникальный идентификатор";
"06 03 55 04 2E"	= "DN-квалификатор";
"06 03 55 04 2F"	= "Расширенный справочник";
"06 03 55 04 30"	= "Информация о протоколе";
"06 03 55 04 31"	= "Отличительное имя";
"06 03 55 04 32"	= "Уникальный член";
"06 03 55 04 33"	= "Домашний идентификатор";
"06 03 55 04 34"	= "Поддерживаемые алгоритмы";
"06 03 55 04 35"	= "Список аннулирования дельта";
"06 03 55 04 36"	= "Очистка";
"06 03 55 04 3A"	= "Перекрестная пара сертификатов";

/* X.500 object classes */

"06 02 55 06"		= "Класс  объекта X.520";
"06 03 55 06 00"	= "Верх";
"06 03 55 06 01"	= "Псевдоним";
"06 03 55 06 02"	= "Страна";
"06 03 55 06 03"	= "Где";
"06 03 55 06 04"	= "Организация";
"06 03 55 06 05"	= "Подразделение";
"06 03 55 06 06"	= "Пользователь";
"06 03 55 06 07"	= "Сотрудник организации";
"06 03 55 06 08"	= "Функция в организации";
"06 03 55 06 09"	= "Группа имен";
"06 03 55 06 0A"	= "Бытовой потребитель";
"06 03 55 06 0B"	= "Прикладной процесс";
"06 03 55 06 0C"	= "Прикладной компонент";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Устройство";
"06 03 55 06 0F"	= "Пользователь со строгой аутентификацией";
"06 03 55 06 10"	= "Бюро сертификации";
"06 03 55 06 11"	= "Группа уникальных имен";
"06 03 55 06 15"	= "Пользователь PKI";
"06 03 55 06 16"	= "Бюро сертификации PKI";

/* X.500 algorithms */

"06 02 55 08"		= "Алгоритмы X.500";
"06 03 55 08 01"	= "Алгоритмы шифрования X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Расширения сертификатов X.509";
"06 03 55 1D 01"	= "Идентификатор ключа органа сертификации (старый)";
"06 03 55 1D 02"	= "Атрибуты основного ключа (старые)";
"06 03 55 1D 03"	= "Политики сертификатов (старые)";
"06 03 55 1D 04"	= "Ограничение использования ключа (старое)";
"06 03 55 1D 05"	= "Отображения политики (старые)";
"06 03 55 1D 06"	= "Ограничение ветвей";
"06 03 55 1D 07"	= "Альтернативное имя субъекта (старое)";
"06 03 55 1D 08"	= "Альтернативное имя эмитента (старое)";
"06 03 55 1D 09"	= "Атрибуты каталога субъекта";
"06 03 55 1D 0A"	= "Основные ограничения (старые 2.5.29.10)";
"06 03 55 1D 0B"	= "Ограничения имени (старые)";
"06 03 55 1D 0C"	= "Ограничения политики (старые)";
"06 03 55 1D 0D"	= "Основные ограничения (старые 2.5.29.13)";
"06 03 55 1D 0E"	= "Субъект";
"06 03 55 1D 0F"	= "Применение";
"06 03 55 1D 10"	= "Период использования личного ключа";
"06 03 55 1D 11"	= "Альтернативное имя субъекта";
"06 03 55 1D 12"	= "Альтернативное имя эмитента";
"06 03 55 1D 13"	= "Основные ограничения";
"06 03 55 1D 14"	= "Номер списка аннулирования сертификата";
"06 03 55 1D 15"	= "Код причины аннулирования сертификата";
"06 03 55 1D 16"	= "Дата истечения срока действия (старая)";
"06 03 55 1D 17"	= "Код инструкции удержания";
"06 03 55 1D 18"	= "Дата недействительности";
"06 03 55 1D 19"	= "Точки распределения аннулирования сертификата (старые)";
"06 03 55 1D 1A"	= "Выпускающая точка распределения (старая)";
"06 03 55 1D 1B"	= "Индикатор аннулирования сертификата дельта";
"06 03 55 1D 1C"	= "Выпускающая точка распределения";
"06 03 55 1D 1D"	= "Эмитент сертификата";
"06 03 55 1D 1E"	= "Ограничения имени";
"06 03 55 1D 1F"	= "Точки распределения аннулирования сертификата";
"06 03 55 1D 20"	= "Политики сертификатов";
"06 04 55 1D 20 00"	= "Идентификатор «Любой политики»";
"06 03 55 1D 21"	= "Отображения политики";
"06 03 55 1D 22"	= "Ограничения политики";
"06 03 55 1D 23"	= "Идентификатор ключа органа сертификации";
"06 03 55 1D 24"	= "Ограничения политики";
"06 03 55 1D 25"	= "Расширенное использование ключа";
"06 04 55 1D 25 00"	= "Любое расширенное использование ключа";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Алгоритм подписи SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Алгоритм подписи Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Алгоритм конфиденциальности SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Алгоритм конфиденциальности Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Алгоритм целостности SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Алгоритм целостности Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Алгоритм защиты токена SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Алгоритм защиты токена Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Алгоритм управления ключами SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Алгоритм управления ключами Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Алгоритм управления ключами и подписи SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Алгоритм управления ключами и подписи Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Алгоритм подписи сводки A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Алгоритм конфиденциальности сводки A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Алгоритм целостности сводки A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Алгоритм защиты токена сводки A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Алгоритм управления ключами сводки A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Алгоритм управления ключами и подписи сводки A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Обновленный алгоритм подписи Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Алгоритмы управления ключами и обновленных подписей Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Обновленный алгоритм целостности Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Алгоритм обмена ключами";
"06 09 60 86 48 01 65 02 01 01 17"	= "Алгоритм Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "Алгоритм шифрования ключа (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Формат сообщения RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Пустое содержание";
"06 09 60 86 48 01 65 02 01 02 03"	= "Тип содержания CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Тип содержания MSP версии 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Тип содержания MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Протокол агента повторного ввода MSP";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Тип содержания MSP версии 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Переданная часть тела сообщения MSP";
"06 09 60 86 48 01 65 02 01 02 49"	= "Параметры переданного сообщения MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Переданная часть тела сообщения CSP";
"06 09 60 86 48 01 65 02 01 02 51"	= "Параметры переданного сообщения CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Политика безопасности SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Мозаичный PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Политика безопасности";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Общие";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Политика безопасности по умолчанию";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Сертификат управления ключами SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Сертификат подписи пользователя SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Сертификат управления ключами и подписи SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Сертификат управления ключами Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Сертификат управления ключами и подписи Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Сертификат подписи пользователя Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Сертификат подписи органа сертификации Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Сертификат подписи органа сертификации SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Вспомогательный вектор";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Политика приема";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Членство";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Администраторы";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS подпись CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS подпись CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Список аннулирования сертификатов SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Список аннулирования сертификатов Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Процессор изъятых адресов";
"06 09 60 86 48 01 65 02 01 05 30"	= "Защита";
"06 09 60 86 48 01 65 02 01 05 31"	= "Поддерживаемые алгоритмы";
"06 09 60 86 48 01 65 02 01 05 32"	= "Сертификат управления ключами сводки A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Сертификат управления ключами и подписи сводки A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Сертификат подписи пользователя сводки A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Информация PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Ограничения органа сертификации PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Привилегии подписи или управления ключами";
"06 09 60 86 48 01 65 02 01 05 38"	= "Привилегии Comm";
"06 09 60 86 48 01 65 02 01 05 39"	= "Маркированный атрибут";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Файл с информацией о политике";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Файл информации о политике безопасности";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Ограничение очистки органа сертификации";

"06 09 60 86 48 01 65 02 01 07 01"		= "Расширения CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Категории безопасности ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Стандартные привилегии метки безопасности";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Привилегии подписи";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Привилегии управления ключами";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Привилегия именованного набора тегов";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Класс 2 Министерства обороны США";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Класс 4 Министерства обороны США";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Класс 3 Министерства обороны США";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Класс 5 Министерства обороны США";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Класс 3 PKI Министерства обороны США";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Испытать политику безопасности";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 Набор тегов ноль";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 Набор тегов один";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 Набор тегов два";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 Категории безопасности";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 Набор тегов ноль";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 Набор тегов один";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 Набор тегов два";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Категории безопасности Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Имя набора тегов 1 Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Имя набора тегов 2 Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Имя набора тегов 3 Kafka";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Испытать ввод CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Этикетка";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Идентификатор политики GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Рудиментарный идентификатор политики FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Основной идентификатор политики FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Средний идентификатор политики FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Высокий идентификатор политики FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Ключ KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Расширения";
"06 09 60 86 48 01 65 03 02 03 01"		= "Метод восстановления ключа";
"06 09 60 86 48 01 65 03 02 03 02"		= "С возможностью восстановления ключа";
"06 09 60 86 48 01 65 03 02 03 03"		= "Восстановление ключа";
"06 08 60 86 48 01 65 03 02 04"			= "Схемы восстановления ключа";
"06 08 60 86 48 01 65 03 02 05"			= "Расширение CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Алгоритм NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Алгоритм Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "«Пустышка» DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "«Пустышка» DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "«Пустышка» DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "«Пустышка» RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 с шифрованием RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 с шифрованием RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 с шифрованием RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC с SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC с MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "«Пустышка» RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Пакет MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA шифрование BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Пароль NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Тип атрибута PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Атрибуты безопасности";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Предел надежности";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Идентификатор объектов Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Расширение сертификата Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Тип сертификата Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Базовый URL Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL аннулирования Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL аннулирования органа сертификации Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL загрузки CRL Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL загрузки сертификата органа сертификации Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL обновления сертификата Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL политики органа сертификации Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL домашней страницы сертификата Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Логотип объекта сертификата Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Снимок пользователя сертификата Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Тип сервера SSL Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Комментарий сертификата Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Тип данных Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "изображение/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "изображение/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Последовательность сертификатов Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL сертификата Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Идентификатор объектов каталога Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Определения LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Водительские права";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Номер отдела";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Табельный номер";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Тип сотрудника";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Администратор Интранета";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Вентильный шифратор сервера";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Неизвестное расширение Verisign VPN";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Неизвестное расширение Verisign VPN";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Идентификатор политики Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Уведомление Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Орган сертификации Verisign SGC";

/* SET */

"06 03 67 2A 00"	= "Тип содержания";
"06 04 67 2A 00 00"	= "Данные PAN";
"06 04 67 2A 00 01"	= "PAN-токен";
"06 04 67 2A 00 02"	= "Только PAN";

"06 03 67 2A 01"	= "Расширение сообщения";
"06 03 67 2A 02"	= "Поле";
"06 04 67 2A 02 00"	= "Полное имя";
"06 04 67 2A 02 01"	= "Имя";
"06 04 67 2A 02 02"	= "Фамилия";
"06 04 67 2A 02 03"	= "Фамилия при рождении";
"06 04 67 2A 02 04"	= "Географическое название";
"06 04 67 2A 02 05"	= "Идентификационный номер";
"06 04 67 2A 02 06"	= "Месяц";
"06 04 67 2A 02 07"	= "Дата";
"06 04 67 2A 02 08"	= "Адрес";
"06 04 67 2A 02 09"	= "Телефон";
"06 04 67 2A 02 0A"	= "Сумма";
"06 04 67 2A 02 0B"	= "Номер учетной записи";
"06 04 67 2A 02 0C"	= "Пароль";

"06 03 67 2A 03"		= "Атрибут";
"06 04 67 2A 03 00"		= "Сертификат";
"06 05 67 2A 03 00 00"	= "Идентификатор корневого ключа";
"06 05 67 2A 03 00 01"	= "Дополнительная политика";

"06 03 67 2A 04"	= "Алгоритм";
"06 03 67 2A 05"	= "Политика";
"06 04 67 2A 05 00"	= "Корень";
"06 03 67 2A 06"	= "Модуль";
"06 03 67 2A 07"	= "Расширение сертификата";
"06 04 67 2A 07 00"	= "Хешированный ключ корня";
"06 04 67 2A 07 01"	= "Тип сертификата";
"06 04 67 2A 07 02"	= "Данные продавца";
"06 04 67 2A 07 03"	= "Требуется сертификат карты";
"06 04 67 2A 07 04"	= "Туннелирование";
"06 04 67 2A 07 05"	= "Расширения SET";
"06 04 67 2A 07 06"	= "Квалификатор SET";

"06 03 67 2A 08"	= "Бренд";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Производитель";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Национальный";
"06 05 67 2A 0A E2 00"	= "Япония";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Хешированный ключ корня";
"06 04 86 8D 6F 03"	= "Тип сертификата";
"06 04 86 8D 6F 04"	= "Данные продавца";
"06 04 86 8D 6F 05"	= "Требуется сертификат карты";
"06 04 86 8D 6F 06"	= "Туннелирование";
"06 04 86 8D 6F 07"	= "Квалификатор SET";
"06 04 86 8D 6F 63"	= "Данные SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Безопасность данных Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Идентификатор политики доверия Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Политика Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Основная политика Apple X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Политика Apple SSL";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Политика генерирования локальных сертификатов Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Политика генерирования локального CSR Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Политика аннулирования сертификатов Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Политика аннулирования сертификатов Apple OCSP";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Политика Apple S/MIME";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Расширяемая политика аутентификации Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Политика подписи обновления программ Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Политика Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Политика Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Политика подписи ресурсов Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Политика клиента Kerberos Apple";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Политика сервера Kerberos Apple";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Политика подписи кода Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Политика подписи упаковки Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Идентификатор алгоритма безопасности Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Быстрое эллиптическое шифрование (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Безопасное сжатие Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE с подписью MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE с подписью SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Шифрование Apple FEED";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (экспериментальное)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE с подписью ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Идентификатор сертификата Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Запрос сертификата Apple .Mac ";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Запрос сертификата удостоверения Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Запрос сертификата подписи электронной почты Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Запрос сертификата шифрования электронной почты Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Запрос архивного списка Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Запрос архивного хранения Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Запрос извлечения архива Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Запрос удаления архива Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Расширение сертификата Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Удостоверение Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Подпись электронной почты Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Шифрование электронной почты Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Значение запроса сертификата Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Имя пользователя";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Пароль";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Имя хоста";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Обновить флажок";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Асинхронный флажок";

"06 08 2A 86 48 86 F7 63 64 04" = "Расширенное использование ключа Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Кодовая подпись Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Кодовая подпись Apple (разработка)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Подпись обновления программ Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Кодовая подпись Apple (резервная)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Подпись ресурсов Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Подпись Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Шифрование Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Удостоверение системы Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Политики сертификатов Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Политика сертификатов Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Политика сертификата Apple .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Кодовая подпись";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Безопасность Intel CDSA";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Форматы безопасности Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Расширения сертификата X.509v3 ";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Расширения личного сертификата X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Битовая карта подписи субъекта";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Снимок субъекта";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Адрес электронной почты субъекта";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Использовать исключения";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Алгоритмы безопасности Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 с ECDSA";

/* end */
